04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleVoF/trayedPipe/0/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField
{
    type        zonal;

    defaultValue    0;

    zones
    {
        water
        {
            type        cylinder;

            alphaMean   0.25;

            point1  (0 0 0);
            point2  (0 $../system/blockMeshDict!height 0);
            radius  #calc
            "$<scalar>../system/blockMeshDict!radius*sqrt($<scalar>alphaMean)";

            value           1;
        }
    }
}

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    wall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
